[{"model": "api.post", "pk": 1, "fields": {"title": "lodash Prototype Pollution", "description": "from. https://www.npmjs.com/advisories/1523", "content": "Overview\r\nAll versions of lodash are vulnerable to Prototype Pollution. The function zipObjectDeep allows a malicious user to modify the prototype of Object if the property identifiers are user-supplied. Being affected by this issue requires zipping objects based on user-provided property arrays.\r\n\r\nThis vulnerability causes the addition or modification of an existing property that will exist on all objects and may lead to Denial of Service or Code Execution under specific circumstances.\r\n\r\nRemediation\r\nNo fix is currently available. Consider using an alternative package until a fix is made available.", "create_dt": "2020-07-05T13:30:55.904", "modify_dt": "2020-08-15T11:00:02.312", "owner": 1}}, {"model": "api.post", "pk": 2, "fields": {"title": "포스트 코로나19 시대의 유망기술", "description": "과학기술정보통신부 등이 전문가 논의를 거쳐 8개 영역에서 25개 기술을 선정", "content": "과학기술정보통신부와 한국과학기술기획평가원이 전문가 논의를 거쳐 마련한 목록으로 2020년 4월 28일 공개됐다. 포스트 코로나는 코로나바이러스감염증-19 극복 이후 다가올 새로운 시대·상황을 이르는 말이며, 이 목록에는 포스트 코로나19 시대에 각광받을 유망기술 25개가 포함됐다.\r\n\r\n과학기술정보통신부에 따르면 전문가들은 4대 환경변화로 비대면·원격사회로의 전환, 바이오 시장의 새로운 도전과 기회, 자국중심주의 강화에 따른 글로벌 공급망 재편과 산업 스마트화 가속, 위험대응 일상화 및 회복력 중시 사회를 꼽았다. 이 4대 환경변화에 의해 큰 변화가 예상되는 사회·경제영역으로 헬스케어, 교육, 교통, 물류, 제조, 환경, 문화, 정보보안 등의 8개 영역을 선정했고 각 분야별로 5년 내에 현실화가 가능하면서 기술혁신성과 사회·경제적 파급효과가 큰 총 25개 유망기술을 나열했다.\r\n\r\n● 헬스케어: 디지털치료제, AI기반 실시간 질병진단기술, 실시간 생체정보 측정·분석 기술, 감염병 확산 예측·조기경보기술, RNA바이러스 대항 백신기술 \r\n● 교육: 실감형 교육을 위한 가상·혼합현실 기술, AI·빅데이터 기반 맞춤형 학습 기술, 온라인수업용 대용량 통신기술\r\n● 교통: 감염의심자 이송용 자율주행차, 개인맞춤형 라스트마일 모빌리티, 통합교통서비스(MaaS)\r\n● 물류: ICT기반 물류정보 통합플랫폼, 배송용 자율주행로봇, 유통물류센터 스마트화 기술 \r\n● 제조: 디지털트윈, 인간증강기술, 협동로봇기술\r\n● 환경: 의료폐기물 수집·운반용 로봇, 인수공통감염병 통합관리기술 \r\n● 문화: 실감중계 서비스, 딥페이크 탐지기술, 드론기반의 GIS 구축 및 3D 영상화 기술 \r\n● 정보보안: 화상회의 보안성 확보기술, 양자얽힘 기반의 화상보안통신기술, 동형암호 이용 동선추적시스템", "create_dt": "2020-08-02T10:16:07.963", "modify_dt": "2020-08-15T11:01:18.376", "owner": 1}}, {"model": "api.post", "pk": 3, "fields": {"title": "Vue.js News", "description": "Vue.js 3.0 Release Candidate is here! 3.0 Docs in beta; Vue-Devtools beta for Vue 3.0 available and", "content": "Hi there,\r\n\r\ngreat news! We are now closer than ever to the official Vue 3.0 release. The first Release Candidate marks the RC stage of the project which will be followed by a stable stage. You can read the whole announcement here.\r\n\r\nAdditionally the Official Vue.js 3.0 Docs has been released (beta version)! Huge shout-out to the docs team: @NataliaTepluhina, @bencodezen, @phanan and @sdras!\r\n\r\nThis is likely a good moment to start reading the Migration Guide so you can start planning the migration. Don’t worry, if your project is relatively small and you have been following the RFCs, and avoiding to-be-deprecated functionalities, this process should be pretty quick!\r\n\r\nHappy coding!\r\n\r\n— Damian Dulisz", "create_dt": "2020-08-02T10:18:18.279", "modify_dt": "2020-08-15T11:02:11.167", "owner": 1}}, {"model": "api.post", "pk": 4, "fields": {"title": "한글 Hangul 제목은 어떤가요 ?", "description": "test description", "content": "test content", "create_dt": "2020-10-07T15:59:19.782", "modify_dt": "2020-10-07T15:59:19.782", "owner": null}}]